// Задача 13: Напишите программу, которая выводит третью цифру заданного числа или сообщает, 
// что третьей цифры нет.Через строку решать нельзя.

// 645 -> 5
// 78 -> третьей цифры нет
// 32679 -> 6

// Console.WriteLine("Введите число:");
// int num = Convert.ToInt32(Console.ReadLine());

// if (num < -100 || num > 100)
// {
//     int num3 = (num / 100) % 10;
//     Console.WriteLine($"Третья цифра числа {num}: {num3}");
// }
// else
// {
//     Console.WriteLine($"В числе {num} нет третьей цифры");
// }



